DROP TABLE IF EXISTS users_liked_recipes;
DROP TABLE IF EXISTS users_roles;
DROP TABLE IF EXISTS recipes cascade;
DROP TABLE IF EXISTS users cascade;
DROP TABLE IF EXISTS roles cascade;


CREATE TABLE users
(
    id       BIGINT AUTO_INCREMENT NOT NULL,
    username VARCHAR(255)          NOT NULL,
    password VARCHAR(255)          NOT NULL,
    CONSTRAINT pk_users PRIMARY KEY (id)
);

CREATE TABLE roles
(
    id   BIGINT AUTO_INCREMENT NOT NULL,
    name VARCHAR(45)           NOT NULL,
    CONSTRAINT pk_roles PRIMARY KEY (id)
);

CREATE TABLE recipes
(
    id          BIGINT AUTO_INCREMENT NOT NULL,
    title       VARCHAR(255)          NOT NULL,
    description longtext              NOT NULL,
    popularity  INT                   NOT NULL,
    img         VARCHAR(225)          NOT NULL,
    time        varchar(225)          not null,
    difficulty  varchar(225)          not null,
    creator_id  BIGINT                not null,
    CONSTRAINT pk_recipes PRIMARY KEY (id)
);

CREATE TABLE users_roles
(
    role_id BIGINT NOT NULL,
    user_id BIGINT NOT NULL
);

CREATE TABLE users_liked_recipes
(
    user_id   BIGINT NOT NULL,
    recipe_id BIGINT NOT NULL
);

INSERT INTO users (username, password)
VALUES ('user', 'userpass'),
       ('admin', 'adminpass');

INSERT INTO roles (name)
VALUES ('user'),
       ('admin');

INSERT INTO users_roles (role_id, user_id)
VALUES (1, 1),
       (2, 2);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Малиновий торт із морозивом', 'Печиво подрібнюємо, змішуємо з розм’якшеним вершковим маслом та викладаємо у форму з високими знімними бортами. У глибоку посудину викладаємо морозиво і залишаємо на 10–15 хвилин за кімнатної температури. «Малину – апельсин», перетерті із цукром, додаємо до морозива та змішуємо за допомогою блендера. Отриману масу ставимо на півгодини в холодильник для застигання. Викладаємо суміш на корж із печива, розрівнюємо поверхню. Ставимо в морозилку для остаточного замерзання. Виймаємо торт із форми та прикрашаємо цілими ягодами — свіжими або замороженими. ', 0,
        'https://rud.ua/uploads/under_recipe/Malinoviy_tort-morozivo_600x300_61cc2028604e5.jpg', '120 хвилин', 'легко', 1);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Шоколад з какао й молока', 'Коли хочеться поласувати плиткою шоколаду, необов''язково йти до магазину. Якщо у вас є какао порошок, цукор, молоко й трохи вершкового масла, можна приготувати шоколад в домашніх умовах. Успіх переважно залежить від якості какао. Готові суміші найкраще підійдуть для приготування какао та гарячого шоколаду. А без гарного справжнього какао шоколад просто не застигне.

 100 мл молока
 100 гр порошку какао
 50 гр вершкового масла
 50 гр цукру
 0,50 ч. л. ванільного цукру
 горішки, родзинки, цукати
1
Вершкове масло нарізаємо невеликими кубиками, додаємо у сотейник з молоком. Ставимо сотейник на невеликий вогонь та доводимо молоко до кипіння. Але кип''ятити не потрібно!

2
Знімаємо сотейник з вогню й помішуємо масу, поки все масло не розтане. Велике значення для хорошого застигання шоколадної плитки має якість та жирність вершкового масла, найкраще 82,5%.

3
Всипаємо у гаряче молоко цукор, перемішуємо до розчинення. З кількістю цукру у даному рецепті вийде не дуже солодкий шоколад. Якщо бажаєте отримати солодший шоколад, можна додати цукру більше.

4
Далі всипаємо порошок какао, обережно перемішуємо до однорідного стану. Якість какао у порошку у всіх виробників різна, й переконатися у ній доведеться лише досвідченим шляхом. Якщо суміш виходить занадто густою, радимо закип’ятити трохи молока й поступово доливати його до шоколадної маси, розмішуючи до отримання потрібної консистенції.

5
Має вийти блискуча однорідна суміш, густа, як жирна сметана, що не стікає з вінчика. Якщо вийшла рідка й плинна суміш, як глазур, шоколад не застигне. У такому випадку можна додати какао або випаровувати суміш на водяній бані, постійно помішуючи.

6
Додаємо ванільний цукор, за бажанням – горішки, цукати, родзинки до смаку та перемішуємо. Розливаємо гарячу шоколадну масу по формах для цукерок або просто на лист пергаменту.

7
Охолоджуємо шоколад при кімнатній температурі, а потім ставимо форми у морозилку на 1-2 години для повного застигання. Варто врахувати, що такий шоколад швидко тане, адже в ньому немає різних стабілізаторів, які додають при промисловому виробництві шоколадок.

Насолоджуємося натуральним шоколадом власного приготування! Смачного!', 0,
        'https://fayni-recepty.com.ua/wp-content/uploads/2022/04/shokolad-z-kakao-1024x765.jpg', '25 хвилин', 'середня', 1);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Десерт з творогу без цукру','Солодке люблять майже всі. Цукерки, тортики, кексики, шоколадки - ці солодощі завжди подають на десерт, щоб завершити трапезу солодким акордом. Утім, солодке може зашкодити вашій фігурі. Відмовитися від смакоти не просто, а допомогти може десерт без цукру, борошна та олії. Ось рецепт десерта без цукру.

 600 гр творогу
 2 яйця
 1 щіпка ваніліну
 20 гр желатину
 100 гр меду
 40 гр крохмалу
 500 мл молока
1
Залийте желатин 100 мл молока та залиште набухати на 10 хвилин.

2
Змішайте яйця, крохмаль і трохи молока до однорідної маси. По тому долийте молоко, що залишилося, і перемішайте.

3
Поставте суміш на середній вогонь та варіть її, постійно помішуючи. Після того як маса дійде до кипіння, варіть ще хвилину. Коли крем охолоне, додайте мед та ваніль.

4
Збийте сир блендером і додайте крем і нагрітий до 60°С желатин. Збийте до однорідної маси.

5
Перемістіть масу у форму, накрийте плівкою та поставте у холодильник щонайменше на 6 годин. І ось ваш смачний десерт без цукру - готовий!

6
Якщо хочете зробити низькокалорійний десерт дещо солодшим, додайте більше меду. Зверху можна прикрасити частування фруктами чи ягодами.', 0,
        'https://fayni-recepty.com.ua/wp-content/uploads/2021/11/desert-bez-tsukru-1024x666.jpg', '50 хвилин', 'середня', 1);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Флан','Що таке флан? Флан – це традиційний європейський десерт з дуже давньою історією, який сьогодні набув великої популярності по цілому світу. Готується флан нескладно, а його легка тестура підійде до будь якого сезону. Флан можна готувати у вигляді пирога на крихому тісті чи просто у формах для десерту.

 Крухе тісто
 1 л молока
 150 гр цукру
 90 гр кукурудзяного крохмалю
 ванільний цукор або ванільний екстракт
 4 яйця
1
Закип’ятити молоко разом з ваніллю

2
Змішати цукор з крохмалем, додати збиті яйця. Все ретельно вимішати в однорідну масу.

3
До маси влити молоко і перемішати.

4
Нагріти духовку до 200 градусів. У змащену масло круглу форму з високими стінками викласти розкачане тісто і наколоти його виделкою.

5
Вилити молочну суміш поверх тіста.

6
Випікати протягом 30-40 хв

7
Подавати після повного вистигання', 0,
        'https://fayni-recepty.com.ua/wp-content/uploads/2021/07/flan-1024x683.jpg', '1 година 5 хвилин', 'легко', 1);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Полуничне тірамісу','Якщо вам хочеться приготувати щось літньо-полуничне, але водночас не дуже відходити від класики, то пропонуємо рецепт полуничного тірамісу. Цей рецепт технологічно дуже близький до традиційного тірамісу, але ви можете додати фруктової легкості та свіжості. Замочіть печиво не в каві, а в помаранчевому соці, додайте свіжі стиглі полуниці і ви побачите, які нові нотки відкриються вам в смаку цього класичного десерта.

 3 яйця
 3 жовтки
 500 гр маскарпоне
 250 гр печива савоярді
 130 гр цукру
 500 гр полуниць
 200 мл апельсинового соку
1
Всі інгредієнти дістати з холодильника за годину до приготування

2
Відділити білки від жовтків. Жовтки збити з цукром до густої білої. Ввести маскарпоне і ретельно вимішати.

3
Збити білки до піків і дуже ніжно, мішаючи зверху вниз, ввести у суміш.

4
Полуниці розрізати навпіл чи на чотири частини.

5
На дно форми викласти перший шар крему. Викласти шар печива, попередньо кожне занурюючи в апельсиновий сік. Робити це дуже швидко, щоби печиво не розмокало занадто сильно. Зверху викласти половину полуниць.

6
Розділити крем на половину і рівномірно викласти шар крему, тоді решту полуниць, ще шар печива і зверху вкрити кремом, що залишився.

7
Накрити харчовою плівкою і поставити в холодильник на 4 год або на ніч.

8
Перед подачею прикрасити полуницями. Можна посипати какао, при бажанні.', 0,
        'https://fayni-recepty.com.ua/wp-content/uploads/2021/07/polunychne-tiramisu-1-1024x680.jpg', '1 година 30 хвилин', 'середня', 1);

INSERT INTO recipes (title, description, popularity, img, time, difficulty, creator_id)
VALUES ('Шоколадний мус','Лише 4 інгредієнти, лише 15 хв для приготування і наступного дня у вас на столі повітряний, насичений і дуже смачний десерт. Ви можете використовувати той шоколад, який найбільше до вподоби: чорний з високим вмістом какао, щоби отримати інтенсивний смак з характерною гірчинкою, молочний, аби насолодитись ніжним легким смаком, такий мус буде особливо до вподоби дітям чи білий шоколад. Або й навіть суміш всіх трьох. Можна додати карамель, прянощі, помаранчеві цукати (фантастично смакують з чорним шоколадом), пару листочків м''яти і створити свій власний рецепт. Якщо ви не любитель надто солодкого - візьміть шоколад з максимальним вмістом какао і солоне масло. Не бійтесь експериментів, вам не вдасться зіпсувати рецепт шоколадного мусу, ви його лише покращите!

 150 гр Шоколаду (чорного, білого, молочного)
 25 гр Масла
 4 шт Яйця
 25 гр Цукру
1
Поламати чи нарізати шматочками шоколад і розтопити його на паровій бані або в мікрохвильовій печі.

2
Відділити жовтки від білків, білки можна поставити в холодильник, а жовтки збити з цукром до глянцевої, шовковистої маси.

3
Додати жовтки до шоколаду, дуже добре вимішати масу і дати повністю вистигнути.

4
До білків додати щіпку солі і збити до піків.

5
Дуже ніжно і акуратно ввести білки до шоколадної маси. Мішати поки маса не стане однорідною, але дуже плавно, згори до низу, щоби білки не осіли.

6
Розкласти у креманки і поставити в холодильник на ніч.', 0,
        'https://fayni-recepty.com.ua/wp-content/uploads/2021/03/shokoladny-mus-1024x683.jpg', '35 хвилин', 'легко', 1);

INSERT INTO users_created_recipes (user_id, recipe_id)
VALUES (1, 1);